# HOME

SLIDERS = [
    {
        'video_html': 'slider-1.mp4',
        'title': 'Безрамное остекление <b class="font__color-orange">№1</b> в Липецкой обл.',
        'description': 'Производим и устанавливаем лучшее для террасс, беседок и зон отдыха',
        'btn_show': False,
        'btn_url': '#',
        'btn_caption': 'None',
    },
    {
        'video_html': 'slider-2.mp4',
        'title': 'Пластиковые окна в Липецке',
        'description': 'Закажите пластиковые окна напрямую от завода-производителя на <b class="font__color-orange">10%</b> дешевле рынка',
        'btn_show': True,

        # 'btn_url': '#modalLogin',
        'btn_url': 'windows:index',
        'btn_caption': 'Подробнее',
    },
]


ADVANTAGES = [
    {
        'fa_icon': 'fa fa-cog',
        'title': 'Собственное производство на территории России',
        'description': 'Профили и фурнитура для безрамного остекления всегда в наличии на складе в Липецке',
    },
    {
        'fa_icon': 'fa fa-dollar-sign',
        'title': 'Мы не зависим от зарубежных поставок и колебаний валютного курса',
        'description': 'Полное производство в России гарантирует стабильные цены и своевременную доставку',
    },
    {
        'fa_icon': 'fa fa-shield-alt',

        # TODO: сделать страницу просмотра что такое ANOD+ в виде ссылки
        'title': 'Инновационная технология ANOD+',
        'description': 'Высокая износостойкость и долгий срок службы, устойчивость к внешним воздействиям и коррозии, а также возможность окрашивания в любой цвет',
    },
]


QUESTIONS = [
    {
        'title': 'Насколько прочные стекла? Это безопасно для вашего дома?',
        'description': 'Во всех наших системах используется закалённое стекло толщиной 8 и 10 мм, которое отличается высокой прочностью и надежностью. Оно взломостойкое и антивандальное, что означает, что даже сильные удары, будь то от ребенка, футбольного мяча или случайных столкновений, не повредят стекло, обеспечивая безопасность вашего дома.'
    },
    {
        'title': 'Сколько стоит остекление?',
        'description': 'Цена безрамного раздвижного остекления варьируется в зависимости от типа конструкции, размера проёма и выбранной фурнитуры. Стоимость начинается от 18 000 ₽ за м².',
    },
    {
        'title': 'Можно ли использовать системы для остекления дома или квартиры?',
        'description': 'Да, наши системы идеально подходят для использования в квартире, например, для установки перегородки между комнатой и балконом или для остекления самого балкона. В условиях российского климата внешнее остекление стен дома также возможно, если выбрать стеклопакеты с обогревом, которые помогут поддерживать комфортную температуру внутри помещения.',
    },
    {
        'title': 'Сколько времени займет установка остекления?',
        'description': 'Монтаж остекления обычно занимает минимум 1 день. В зависимости от площади установки, процесс может занять 2-3 дня. Мы выполняем все работы "под ключ" — от монтажа до финишной отделки конструкции и вывоза мусора.',
    },
    {
        'title': 'Можно ли сделать профиль цветным?',
        'description': 'Да, благодаря износостойкому покрытию Anod+ наши алюминиевые профили можно покрасить в любой оттенок из палитры RAL (более 100 цветов).',
    },
]


# -----------------------------------------------------------------------------

# WINDOWS

WINDOWS_SLIDERS = [
    {
        'video_html': 'slider-2.mp4',
        'title': 'Пластиковые окна в Липецке',
        'description': 'Закажите пластиковые окна напрямую от завода-производителя на <b class="font__color-orange">10%</b> дешевле рынка',
    },
]

WINDOWS_ABOUT_DESCRIPTION = [
    {
        'number': '1',
        'title': 'Производство ПВХ окон',
        'description': 'Компания "Проф-лайн" — ваш надежный партнер в области производства и установки пластиковых окон с 2009 года. Мы зарекомендовали себя как ведущий производитель в центральном Черноземье, предлагая высококачественные решения, которые отвечают самым строгим стандартам.',
    },
    {
        'number': '2',
        'title': 'Высокое качество',
        'description': 'Мы уверены, что качество — это основа доверия. Наша компания предлагает не просто окна, а надежные решения, которые прослужат вам долгие годы. Мы тщательно контролируем каждый этап производства, чтобы гарантировать высочайшие стандарты качества и долговечности нашей продукции.',
    },
    {
        'number': '3',
        'title': 'Фурнитура и профили',
        'description': 'Мы гордимся тем, что предлагаем высококачественные окна, оснащенные фурнитурой от ведущих производителей <a class="font__color-orange" href="https://futuruss.ru/" target="_blank">Futurus</a> и <a class="font__color-orange" href="https://www.siegenia.com/ru" target="_blank">Siegenia</a>. Используя профили <a class="font__color-orange" href="https://lumenokna.ru/" target="_blank">Lumen</a> и <a class="font__color-orange" href="https://www.melke.ru/" target="_blank">Melke</a>, а также стеклопакеты <a class="font__color-orange" href="https://www.stis.ru/" target="_blank">STiS</a>, мы обеспечиваем долговечность и надежность каждой конструкции.',
    },
]


WINDOWS_ABOUT_WINDOWS = [
    {
        'subject': '2-х створчатое',
        'price': '23 500',
        'title': 'Универсальное решение для квартиры или частного дома',
        'description': 'Обеспечивает хорошую тепло- и звукоизоляцию, удобно в использовании и легко вписывается в любой интерьер',
        'img': 'about-1.png',

        'properties': {
            'properties_1': 'Размер: 1300 х 1400 мм',
            'properties_2': 'Монтажная глубина: 58',
            'properties_3': 'Воздушные камеры: 3',
            'properties_4': 'Уплотнение: черное',
            'properties_5': 'Ширина стеклопакета: 24 мм',
            'properties_6': 'Подоконник: да',
            'properties_7': 'Откосы: да',
            'properties_8': 'Отлив: да',
            'properties_9': 'Монтаж по ГОСТу: да',
        }
    },
    {
        'subject': '3-х створчатое',
        'price': '31 000',
        'title': 'Максимальное освещение и комфорт в вашем доме',
        'description': 'Широкие окна обеспечивают больше света, сохраняя тепло и уют. Идеально подходит для больших помещений',
        'img': 'about-2.png',
        'properties': {
            'properties_1': '2100 х 1400 мм',
            'properties_2': 'Монтажная глубина: 58',
            'properties_3': 'Воздушные камеры: 3',
            'properties_4': 'Уплотнение: черное',
            'properties_5': 'Ширина стеклопакета: 24 мм',
            'properties_6': 'Подоконник: да',
            'properties_7': 'Откосы: да',
            'properties_8': 'Отлив: да',
            'properties_9': 'Монтаж по ГОСТу: да',
        }
    },
    {
        'subject': 'Балкон',
        'price': '38 000',
        'title': 'Функциональность и практичность для балкона',
        'description': 'Комплексное решение для остекления балкона или лоджии, которое сочетает в себе высокое качество и удобство эксплуатации.',
        'img': 'about-3.png',
        'properties': {
            'properties_1': '1400 х 2100 мм',
            'properties_2': 'Монтажная глубина: 58',
            'properties_3': 'Воздушные камеры: 3',
            'properties_4': 'Уплотнение: черное',
            'properties_5': 'Ширина стеклопакета: 24 мм',
            'properties_6': 'Подоконник: да',
            'properties_7': 'Откосы: да',
            'properties_8': 'Отлив: да',
            'properties_9': 'Монтаж по ГОСТу: да',
        }
    },
]


WINDOWS_PORTFOLIO = [
    {
        'img_small': 'small_portf_1.jpg',
        'img_big': 'big_portf_1.jpg',
        'img_alt': 'ЖК Атмосфера 2.0 - корп. 1, ул. Игнатьева Ф.С., д, Липецк',
    },
    {
        'img_small': 'small_portf_2.jpg',
        'img_big': 'big_portf_2.jpg',
        'img_alt': 'ЖК Капитал - ул. Интернациональная, 13 стр',
    },
    {
        'img_small': 'small_portf_3.jpg',
        'img_big': 'big_portf_3.jpg',
        'img_alt': 'ЖК Интер - ул. Мусоргского, 3, Липецк',
    },
    {
        'img_small': 'small_portf_4.jpg',
        'img_big': 'big_portf_4.jpg',
        'img_alt': 'ЖК Парус - ул. Студёновская, Липецк',
    },
    {
        'img_small': 'small_portf_5.jpg',
        'img_big': 'big_portf_5.jpg',
        'img_alt': 'ЖК Stork Hotels - ул. М.И. Неделина, Липецк',
    },
    {
        'img_small': 'small_portf_6.jpg',
        'img_big': 'big_portf_6.jpg',
        'img_alt': 'ЖК 12 -  ул. Гагарина, 93, Липецк',
    },
    {
        'img_small': 'small_portf_7.jpg',
        'img_big': 'big_portf_7.jpg',
        'img_alt': 'ЖК Время - Индустриальная улица, 90, Липецк',
    },
    {
        'img_small': 'small_portf_8.jpg',
        'img_big': 'big_portf_8.jpg',
        'img_alt': 'Граф-хаус - ул. Неделина, Липецк',
    },
    {
        'img_small': 'small_portf_9.jpg',
        'img_big': 'big_portf_9.jpg',
        'img_alt': 'ЖК На Депутатской - ул. Депутатская, Липецк',
    },
    {
        'img_small': 'small_portf_10.jpg',
        'img_big': 'big_portf_10.jpg',
        'img_alt': 'ЖК Парк - ул. С.Ф. Балмочных, 26, Липецк',
    },
    {
        'img_small': 'small_portf_11.jpg',
        'img_big': 'big_portf_11.jpg',
        'img_alt': 'ЖК Триумф - ул. А.Г. Стаханова, 77к1, Липецк',
    },
    {
        'img_small': 'small_portf_12.jpg',
        'img_big': 'big_portf_12.jpg',
        'img_alt': 'ЖК Инстеп.Перова -  ул. Перова, Липецк',
    },
    {
        'img_small': 'small_portf_13.jpg',
        'img_big': 'big_portf_13.jpg',
        'img_alt': 'ЖК Эльта - Липецкая обл., Елец, ул. Радиотехническая / ул. Героев',
    },
    {
        'img_small': 'small_portf_14.jpg',
        'img_big': 'big_portf_14.jpg',
        'img_alt': 'ЖК Авторский - ул. Железнякова, д. 8, Липецк',
    },
    {
        'img_small': 'small_portf_15.jpg',
        'img_big': 'big_portf_15.jpg',
        'img_alt': 'ЖК Весна - л. Леонтия Кривенкова / ул. И.В. Свиридова, Липецк',
    },
    {
        'img_small': 'small_portf_16.jpg',
        'img_big': 'big_portf_16.jpg',
        'img_alt': 'КП Романово - жилой комплекс Romanovo Sity, Липецкая обл.',
    },
    {
        'img_small': 'small_portf_17.jpg',
        'img_big': 'big_portf_17.jpg',
        'img_alt': 'КП Времена года -  ул. Свиридова, д. 18, п.5, Липецк',
    },
    {
        'img_small': 'small_portf_18.jpg',
        'img_big': 'big_portf_18.jpg',
        'img_alt': 'КП Липчанка - территория Ленинский Лесхоз, Ярлуковский сельсовет, Грязинский район, Липецкая область',
    },
]


WINDOWS_SERVICES = [
    {
        'img': '1.jpg',
        'title': 'Остекление балконов',
        'description': 'Профессиональное остекление балконов и лоджий по выгодным ценам с использованием современных материалов',
    },
    {
        'img': '2.jpg',
        'title': 'Окна для дома',
        'description': 'Мы устанавливаем окна для загородных домов и коттеджей, гарантируя качество и долговечность',
    },
    {
        'img': '3.jpg',
        'title': 'Комплексное остекление',
        'description': 'Полный цикл работ по остеклению квартир и коммерческих объектов с использованием ПВХ и алюминиевых профилей',
    },
    {
        'img': '4.jpg',
        'title': 'Собственное производство',
        'description': 'Изготавливаем и поставляем оконные конструкции напрямую с собственного производства, обеспечивая контроль качества',
    },
]


# -----------------------------------------------------------------------------

# ОБЩЕЕ

NOTIFICATION = {
    'mail_send_ok': {
        'img': '✉️',
        'title': 'Заявка отправлена!',
        'text': """
            Спасибо что выбрали нас!
            <br>
            Наш менеджер уже допивает кофе и совсем скоро свяжется с Вами
        """,
    },
}

